Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
/* lib/rx_hal/src/riic.c */

/**
 * @file riic.c
 * @brief RIIC (I2C) Driver Implementation for RX72N
 *
 * @details
 * **Production-grade implementation** of the I2C Bus Interface (RIIC) peripheral
 * driver for the RX72N microcontroller. This driver provides controller-mode
 * I2C communication with support for standard (100 kHz), fast (400 kHz), and
 * fast-plus (1 MHz) modes.
 *
 * ## Module Architecture
 *
 * ```
 * ┌─────────────────────────────────────────────────────────────────────────┐
 * │                         RIIC Driver Architecture                        │
 * ├─────────────────────────────────────────────────────────────────────────┤
 * │                                                                         │
 * │   Application Layer                                                     │
 * │   ┌─────────────────────────────────────────────────────────────────┐  │
 * │   │  riic_init()  riic_write()  riic_read()  riic_write_read()     │  │
 * │   └──────────────────────────┬──────────────────────────────────────┘  │
 * │                              │                                         │
 * │   Internal Layer            │                                         │
 * │   ┌──────────────────────────┴──────────────────────────────────────┐  │
 * │   │  internal_get_riic_base()     - Channel to address mapping      │  │
 * │   │  internal_calculate_bit_rate() - Frequency calculation          │  │
 * │   │  internal_wait_bus_ready()     - Bus arbitration                │  │
 * │   │  internal_send_start()         - START condition generation     │  │
 * │   │  internal_send_stop()          - STOP condition generation      │  │
 * │   │  internal_write_byte()         - Single byte transmission       │  │
 * │   │  internal_read_byte()          - Single byte reception          │  │
 * │   │  internal_riic_write_phase()   - Combined write sequence        │  │
 * │   │  internal_riic_read_phase()    - Combined read sequence         │  │
 * │   └──────────────────────────┬──────────────────────────────────────┘  │
 * │                              │                                         │
 * │   Hardware Layer            │                                         │
 * │   ┌──────────────────────────┴──────────────────────────────────────┐  │
 * │   │  RIIC0: 0x00088300  (SCL0/P16, SDA0/P17)                        │  │
 * │   │  RIIC1: 0x00088320  (SCL1/P21, SDA1/P20)                        │  │
 * │   │  RIIC2: 0x00088340  (SCL2/P66, SDA2/P67)                        │  │
 * │   └─────────────────────────────────────────────────────────────────┘  │
 * │                                                                         │
 * └─────────────────────────────────────────────────────────────────────────┘
 * ```
 *
 * ## I2C Protocol Implementation
 *
 * This driver implements the I2C protocol in controller mode:
 *
 * ### Write Transaction
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + W (0) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── Data Byte 0 ─────────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── Data Byte N ─────────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── STOP ────────────────────────────────▶│
 * ```
 *
 * ### Read Transaction
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + R (1) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │◀─── Data Byte 0 ─────────────────────────◀─│
 *     │──── ACK ─────────────────────────────────▶│
 *     │◀─── Data Byte N ─────────────────────────◀─│
 *     │──── NACK (last byte) ───────────────────▶│
 *     │──── STOP ────────────────────────────────▶│
 * ```
 *
 * ### Write-Read Transaction (Register Read)
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + W (0) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── Register Address ────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── REPEATED START ──────────────────────▶│
 *     │──── Address + R (1) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │◀─── Data Byte 0 ─────────────────────────◀─│
 *     │──── NACK ────────────────────────────────▶│
 *     │──── STOP ────────────────────────────────▶│
 * ```
 *
 * ## Bit Rate Calculation
 *
 * The I2C clock frequency is calculated from PCLKB (60 MHz) as:
 *
 * @f[
 *   f_{SCL} = \frac{f_{PCLKB}}{(ICBRL + ICBRH + 2) \times 2^{CKS}}
 * @f]
 *
 * For simplified calculation with 50% duty cycle (ICBRL = ICBRH):
 *
 * @f[
 *   \text{divisor} = \frac{f_{PCLKB}}{f_{SCL} \times 3}
 * @f]
 *
 * | Mode       | Speed   | Divisor | Actual Rate |
 * |------------|---------|---------|-------------|
 * | Standard   | 100 kHz | 200     | 100.0 kHz   |
 * | Fast       | 400 kHz | 50      | 400.0 kHz   |
 * | Fast Plus  | 1 MHz   | 20      | 1.00 MHz    |
 *
 * ## Memory Map (Chapter 42 - RIIC)
 *
 * | Channel | Base Address | Pin SCL | Pin SDA | MSTPCRB Bit |
 * |---------|--------------|---------|---------|-------------|
 * | RIIC0   | 0x00088300   | P16     | P17     | MSTPB21     |
 * | RIIC1   | 0x00088320   | P21     | P20     | MSTPB20     |
 * | RIIC2   | 0x00088340   | P66     | P67     | MSTPB19     |
 *
 * ## Register Offsets (per channel)
 *
 * | Offset | Register | Description              |
 * |--------|----------|--------------------------|
 * | 0x00   | ICCR1    | Control Register 1       |
 * | 0x01   | ICCR2    | Control Register 2       |
 * | 0x02   | ICMR1    | Mode Register 1          |
 * | 0x03   | ICMR2    | Mode Register 2          |
 * | 0x04   | ICMR3    | Mode Register 3          |
 * | 0x10   | ICBRL    | Bit Rate Low period      |
 * | 0x11   | ICBRH    | Bit Rate High period     |
 * | 0x12   | ICDRT    | Transmit Data Register   |
 * | 0x13   | ICDRR    | Receive Data Register    |
 *
 * ## Error Handling
 *
 * The driver provides comprehensive error detection:
 * - **k_rx_err_null_ptr**: nullptr passed to function
 * - **k_rx_err_invalid_arg**: Invalid channel, address, or frequency
 * - **k_rx_err_invalid_state**: Channel not initialized
 * - **k_rx_err_timeout**: Bus busy or operation timeout
 * - **k_rx_err_nack**: Peripheral did not acknowledge
 *
 * ## NASA Power of 10 Compliance
 *
 * | Rule | Implementation |
 * |------|----------------|
 * | Rule 1 | No goto, setjmp, or recursion - sequential error handling |
 * | Rule 2 | Bounded loops - all loops use k_riic_timeout_us timeout |
 * | Rule 3 | No dynamic memory - static channel state array |
 * | Rule 4 | Short functions - each < 60 lines |
 * | Rule 5 | Validation - RX_CHECK_NULL_PTR, RX_CHECK_RANGE_TAG |
 * | Rule 6 | Smallest scope - local variables declared at point of use |
 * | Rule 7 | All return values checked - RX_RETURN_ON_ERROR |
 * | Rule 8 | Limited preprocessor - only RX_CHECK macros |
 * | Rule 9 | Function pointers via interface pattern (not used here) |
 * | Rule 10 | Compiles with -Wall -Wextra -Werror |
 *
 * ## SOLID Principles Compliance
 *
 * | Principle | Implementation |
 * |-----------|----------------|
 * | **S** Single Responsibility | Driver handles only RIIC I2C operations |
 * | **O** Open/Closed | Supports multiple frequencies via parameter |
 * | **L** Liskov Substitution | Consistent error codes across all functions |
 * | **I** Interface Segregation | Separate read/write/write-read APIs |
 * | **D** Dependency Inversion | Uses hardware.h abstraction for registers |
 *
 * @par Thread Safety
 * This module is **NOT thread-safe**. Each RIIC channel should be accessed
 * by only one thread at a time. If multiple threads need I2C access, provide
 * external synchronization (mutex/semaphore) at the application level.
 *
 * @par Example: Read Temperature Sensor
 * @code
 * // Initialize RIIC0 at 400 kHz (Fast mode)
 * riic_channel_t channel = {.value = 0};
 * rx_err_t err = riic_init(channel, 400000);
 * if (err != k_rx_ok) {
 *     handle_error(err);
 *     return;
 * }
 *
 * // Read 2 bytes from temperature sensor at address 0x48
 * i2c_device_addr_t sensor_addr = {.value = 0x48};
 * uint8_t temp_reg = 0x00;  // Temperature register
 * uint8_t temp_data[2];
 *
 * err = riic_write_read(channel, sensor_addr, &temp_reg, 1, temp_data, 2);
 * if (err == k_rx_ok) {
 *     int16_t raw_temp = (temp_data[0] << 8) | temp_data[1];
 *     float celsius = raw_temp * 0.0625f;  // LM75 resolution
 * }
 * @endcode
 *
 * @see rx72n_riic_regs.h RIIC register definitions
 * @see hardware.h Hardware abstraction layer
 *
 * @par Manual Reference
 * RX72N Group User's Manual: Hardware, Chapter 42 (I2C-bus Interface)
 *
 * @date 2026-01-01
 * @copyright Copyright (c) 2026 STAR Project
 */

#include <string.h>

#include "hardware.h"
#include "rx72n_regs.h"
#include "rx_register_protection.h"

