Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
/* =============================================================================
 * Constants
 * =============================================================================
 * All constants use C23 typed enums per STAR coding standards.
 * No magic numbers - every value has a named constant with documentation.
 * =============================================================================
 */

/**
 * @enum riic_constants_t
 * @brief RIIC channel count, timeout, and transfer limit constants
 *
 * @details
 * General-purpose constants for RIIC driver operation including channel
 * limits, timeout values, and transfer size constraints.
 *
 * @par Timeout Selection
 * The 10ms timeout provides sufficient margin for:
 * - Standard mode: 100 kHz = 10µs/bit, 90µs/byte -> 10ms = ~111 bytes
 * - Fast mode: 400 kHz = 2.5µs/bit, 22.5µs/byte -> 10ms = ~444 bytes
 * - Fast Plus: 1 MHz = 1µs/bit, 9µs/byte -> 10ms = ~1111 bytes
 *
 * @invariant k_riic_max_channels == 3 (hardware limitation)
 * @invariant k_riic_max_transfer_length == 256 (single-byte length limit)
 */
typedef enum : uint32_t {
  k_riic_max_channels        = 3,     /**< Total RIIC channels: RIIC0, RIIC1, RIIC2 */
  k_riic_timeout_us          = 10000, /**< 10ms timeout for I2C operations (microseconds) */
  k_riic_timeout_zero        = 0,     /**< Timeout counter expired sentinel value */
  k_riic_length_zero         = 0,     /**< Zero-length transfer (invalid) sentinel */
  k_riic_last_index_offset   = 1,     /**< Offset to calculate last byte index from length */
  k_riic_max_transfer_length = 256,   /**< Maximum bytes per transfer operation */
} riic_constants_t;

/**
 * @enum riic_channel_num_t
 * @brief RIIC channel identifiers for switch statement dispatch
 *
 * @details
 * Provides named constants for channel selection in internal_get_riic_base().
 * Using enums instead of raw integers ensures type safety and improves
 * code readability in switch statements.
 *
 * @par Channel to Pin Mapping
 * | Channel | SCL Pin | SDA Pin | Base Address |
 * |---------|---------|---------|--------------|
 * | RIIC0   | P16     | P17     | 0x00088300   |
 * | RIIC1   | P21     | P20     | 0x00088320   |
 * | RIIC2   | P66     | P67     | 0x00088340   |
 *
 * @invariant Values are contiguous starting from 0 and match hardware channel indices
 *
 * @code
 * // Select channel 0 base address
 * volatile rx_riic_regs_t* regs = internal_get_riic_base(k_riic_channel_0);
 * @endcode
 *
 * @see internal_get_riic_base() Maps channel number to hardware register pointer
 * @see riic_constants_t For k_riic_max_channels bound used with these values
 */
typedef enum : uint8_t {
  k_riic_channel_0 = 0, /**< RIIC channel 0 (P16/SCL0, P17/SDA0) */
  k_riic_channel_1 = 1, /**< RIIC channel 1 (P21/SCL1, P20/SDA1) */
  k_riic_channel_2 = 2, /**< RIIC channel 2 (P66/SCL2, P67/SDA2) */
} riic_channel_num_t;

/**
 * @enum riic_module_stop_bits_t
 * @brief RIIC module stop bit positions in MSTPCRB register
 *
 * @details
 * The RX72N uses a module stop mechanism to reduce power consumption.
 * Each peripheral can be stopped/started by setting/clearing its
 * corresponding bit in MSTPCRB. RIIC channels must be enabled (bit cleared)
 * before use.
 *
 * @par Module Enable Procedure
 * 1. Unlock register protection: PRCR = k_rx_prcr_unlock_prc1_prc3
 * 2. Clear module stop bit: MSTPCRB &= ~(1 << k_riic_mstpb_riicX)
 * 3. Lock register protection: PRCR = k_rx_prcr_lock
 *
 * @see rx_register_protection.h for PRCR register access
 */
typedef enum : uint8_t {
  k_riic_mstpb_riic0     = 21, /**< MSTPCRB bit 21: RIIC0 module stop control */
  k_riic_mstpb_riic1     = 20, /**< MSTPCRB bit 20: RIIC1 module stop control */
  k_riic_mstpb_riic2     = 19, /**< MSTPCRB bit 19: RIIC2 module stop control */
  k_riic_mstpb_bit_value = 1,  /**< Single bit value for bit manipulation */
} riic_module_stop_bits_t;

/**
 * @enum riic_frequency_t
 * @brief Supported I2C bus frequencies (Hz)
 *
 * @details
 * I2C standard defines three speed grades. This driver supports all three
 * modes with appropriate bit rate register configuration.
 *
 * @par Timing Characteristics (at PCLKB = 60 MHz)
 * | Mode       | Frequency | Bit Time | Byte Time | Max Cable |
 * |------------|-----------|----------|-----------|-----------|
 * | Standard   | 100 kHz   | 10 µs    | 90 µs     | ~1 meter  |
 * | Fast       | 400 kHz   | 2.5 µs   | 22.5 µs   | ~0.5 m    |
 * | Fast Plus  | 1 MHz     | 1 µs     | 9 µs      | ~0.2 m    |
 *
 * @invariant Only these three discrete values are accepted by riic_init()
 *
 * @code
 * // Initialize channel 0 at standard (100 kHz) mode
 * riic_channel_t ch = {.value = 0};
 * rx_err_t err = riic_init(ch, k_riic_freq_100khz);
 * @endcode
 *
 * @see riic_init() Validates frequency_hz against these enum values
 * @see internal_calculate_bit_rate() Uses frequency to compute ICBRL/ICBRH
 *
 * @note Fast Plus mode requires pull-up resistors < 1kΩ for proper rise time.
 */
typedef enum : uint32_t {
  k_riic_freq_100khz = 100000,  /**< Standard mode: 100 kHz (Sm) */
  k_riic_freq_400khz = 400000,  /**< Fast mode: 400 kHz (Fm) */
  k_riic_freq_1mhz   = 1000000, /**< Fast mode plus: 1 MHz (Fm+) */
} riic_frequency_t;

/**
 * @enum riic_bit_rate_t
 * @brief Bit rate calculation constants for ICBRL/ICBRH registers
 *
 * @details
 * These constants are used in internal_calculate_bit_rate() to compute
 * the correct ICBRL and ICBRH register values for a target frequency.
 *
 * @par Calculation Formula
 * For 50% duty cycle (ICBRL = ICBRH = divisor):
 * @f[
 *   \text{divisor} = \frac{f_{PCLKB}}{f_{target} \times 3}
 * @f]
 *
 * Where the factor of 3 accounts for:
 * - SCL high period (ICBRH + 1) cycles
 * - SCL low period (ICBRL + 1) cycles
 * - Internal synchronization overhead
 */
typedef enum : uint8_t {
  k_riic_brr_divisor = 3,   /**< Divisor constant for 50% duty cycle formula */
  k_riic_brr_min     = 1,   /**< Minimum valid divisor (fastest clock) */
  k_riic_brr_max     = 255, /**< Maximum valid divisor (8-bit register limit) */
} riic_bit_rate_t;

/**
 * @enum riic_icmr1_values_t
 * @brief ICMR1 (Mode Register 1) configuration values
 *
 * @details
 * ICMR1 configures the controller/peripheral mode and addressing type.
 * For STAR project, we use controller mode with 7-bit addressing.
 *
 * @par ICMR1 Register Layout (Bits 7-4)
 * | Bit | Name | Description |
 * |-----|------|-------------|
 * | 6-4 | CKS  | Clock divider (0-7) |
 * | 3   | BCWP | BC write protect |
 * | 2-0 | BC   | Bit counter |
 */
typedef enum : uint8_t {
  k_riic_icmr1_controller_7bit = 8, /**< CKS=0, controller mode, 7-bit addressing */
} riic_icmr1_values_t;

/**
 * @enum riic_icmr2_values_t
 * @brief ICMR2 (Mode Register 2) configuration values
 *
 * @details
 * ICMR2 configures hardware timeout detection and SDA output hold-time delay.
 * The STAR project disables hardware timeout (TMOE = 0) because bus-busy
 * detection is handled in software by internal_wait_bus_ready() using the
 * k_riic_timeout_us countdown. The SDA output delay is also left at zero
 * (no additional hold time) since the pull-up resistors on the target PCB
 * provide adequate signal integrity at all supported speeds.
 *
 * ## ICMR2 Register Bit Layout
 *
 * | Bit | Name  | Function                          | Value Used |
 * |-----|-------|-----------------------------------|------------|
 * |  7  | TMOH  | Timeout detection (high period)   | 0 (off)    |
 * |  6  | TMOL  | Timeout detection (low period)    | 0 (off)    |
 * |  5  | TMOE  | Timeout enable                    | 0 (off)    |
 * | 4:3 | SDDL  | SDA output hold-time delay        | 0 (none)   |
 * |  2  | DLCS  | SDA delay clock source            | 0          |
 * | 1:0 | -     | Reserved                          | 0          |
 *
 * @invariant k_riic_icmr2_default == 0; writing 0x00 leaves all ICMR2 control
 *            bits in their hardware-reset state (timeouts off, no SDA delay)
 *
 * @code
 * // Apply default ICMR2 configuration during RIIC channel initialization
 * volatile rx_riic_regs_t* riic = internal_get_riic_base(k_riic_channel_0);
 * riic->icmr2 = k_riic_icmr2_default;
 * @endcode
 *
 * @see riic_init() Applies this value during channel initialization
 * @see k_riic_timeout_us Software timeout used instead of hardware TMOE
 */
typedef enum : uint8_t {
  k_riic_icmr2_default = 0, /**< No hardware timeout, no SDA delay */
} riic_icmr2_values_t;

/**
 * @enum riic_icmr3_bits_t
 * @brief ICMR3 (Mode Register 3) ACK/NACK control bit definitions
 *
 * @details
 * ICMR3 controls ACK/NACK transmission during receive operations. The key
 * field is ACKBT (Acknowledge Bit), which determines whether the controller
 * sends an ACK or NACK after each received byte.
 *
 * ## ACK/NACK Signalling Rules (I2C Specification)
 *
 * - Set ACKBT=0 (clear bit) to send ACK: instructs the peripheral to continue
 *   transmitting; used for all bytes except the last in a read transfer.
 * - Set ACKBT=1 (set bit) to send NACK: instructs the peripheral to stop
 *   transmitting; must be applied before clocking in the final byte so that
 *   the NACK is sent automatically at the correct clock edge.
 *
 * ## ICMR3 Register Bit Layout (relevant bits)
 *
 * | Bit | Name  | Function                  |
 * |-----|-------|---------------------------|
 * |  3  | ACKBT | ACK/NACK bit to transmit  |
 * |  2  | ACKWP | ACKBT write protect       |
 *
 * @invariant k_riic_icmr3_ackbt_pos == 3 matches the RX72N hardware bit
 *            position for ACKBT in ICMR3; changing this breaks ACK/NACK control
 * @invariant k_riic_icmr3_ackbt_mask == (1U << 3) == 0x08; derived from pos
 *
 * @note NACK must be sent before reading the last byte to signal to the
 *       peripheral that the transfer is complete per I2C specification.
 *
 * @code
 * // Prepare to NACK the last byte in a read transfer
 * volatile rx_riic_regs_t* riic = internal_get_riic_base(k_riic_channel_0);
 * riic->icmr3 |= k_riic_icmr3_ackbt_mask;   // Set ACKBT=1 → send NACK
 *
 * // Re-enable ACK for subsequent transfers
 * riic->icmr3 &= (uint8_t)~k_riic_icmr3_ackbt_mask;  // Set ACKBT=0 → send ACK
 * @endcode
 *
 * @see internal_read_byte() Uses these constants to control ACK/NACK output
 * @see riic_read() Orchestrates NACK signalling for multi-byte reads
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_riic_icmr3_ackbt_pos  = 3,                              /**< ACKBT bit position (bit 3) */
  k_riic_icmr3_ackbt_mask = (1U << k_riic_icmr3_ackbt_pos), /**< ACKBT bit mask (0x08) */
} riic_icmr3_bits_t;

/**
 * @enum riic_address_bits_t
 * @brief I2C 7-bit address formatting constants
 *
 * @details
 * I2C uses a 7-bit address plus a read/write direction bit in the first
 * byte after START. The address is left-shifted by 1 and OR'd with the
 * direction bit.
 *
 * @par Address Byte Format
 * ```
 *   Bit:  7  6  5  4  3  2  1  0
 *         ├──────────────┤  └─ R/W (0=Write, 1=Read)
 *         └─ 7-bit Address
 * ```
 *
 * @par Address Calculation
 * - Write to 0x50: (0x50 << 1) | 0 = 0xA0
 * - Read from 0x50: (0x50 << 1) | 1 = 0xA1
 *
 * @invariant k_riic_addr_max_7bit == 127 (I2C spec: addresses 0x00-0x7F)
 *
 * @code
 * // Format a write address byte for device at 0x50
 * riic_device_addr_t dev = {.value = 0x50};
 * uint8_t addr_byte = (uint8_t)((dev.value << k_riic_addr_shift) | k_riic_addr_write_bit);
 * @endcode
 *
 * @see internal_write_byte() Uses these constants to format address bytes
 * @see riic_write() Passes formatted address bytes during write transactions
 */
typedef enum : uint8_t {
  k_riic_addr_shift     = 1,   /**< Left shift amount for 7-bit address */
  k_riic_addr_write_bit = 0,   /**< R/W bit value for write operation */
  k_riic_addr_read_bit  = 1,   /**< R/W bit value for read operation */
  k_riic_addr_max_7bit  = 127, /**< Maximum valid 7-bit address (0x7F) */
} riic_address_bits_t;

