Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
/* =============================================================================
 * Static Variables
 * =============================================================================
 * Module-level state variables. These track initialization status and
 * provide logging context. Protected by the s_ prefix per STAR coding standards.
 * =============================================================================
 */

/**
 * @var s_tag
 * @brief Logging tag for RIIC driver messages
 *
 * @details
 * Used with rx_log_error() and rx_log_debug() for consistent log output
 * formatting. All RIIC driver log messages are prefixed with "RIIC".
 *
 * @note Not thread-safe, but read-only after initialization.
 */
static const char* s_tag = "RIIC";

/**
 * @var s_riic_channel_initialized
 * @brief Channel initialization state tracking array
 *
 * @details
 * Tracks which RIIC channels have been successfully initialized via riic_init().
 * Used to prevent operations on uninitialized channels.
 *
 * | Index | Channel | Initial State |
 * |-------|---------|---------------|
 * | 0     | RIIC0   | false         |
 * | 1     | RIIC1   | false         |
 * | 2     | RIIC2   | false         |
 *
 * @invariant Array size == k_riic_max_channels (3)
 * @invariant Values are only modified by riic_init()
 *
 * @warning Do not modify directly - only riic_init() should set these flags.
 * @note Not thread-safe; if multiple threads use RIIC, provide external sync.
 */
static bool s_riic_channel_initialized[k_riic_max_channels] = {false, false, false};

/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 * These functions provide low-level I2C operations used by the public API.
 * All internal functions follow NASA Power of 10 rules for safety-critical code.
 * =============================================================================
 */

/**
 * @brief Get RIIC channel register base address from channel number
 *
 * @details
 * Maps an RIIC channel number (0-2) to its corresponding hardware register
 * base address using a compile-time-dispatched switch statement. This function
 * is the single point of truth for the channel-to-address mapping and provides
 * a clean abstraction between the logical channel index used throughout the
 * driver and the physical memory-mapped peripheral addresses defined by the
 * RX72N hardware.
 *
 * ## Channel-to-Address Mapping
 *
 * The three RIIC channels are located at fixed, evenly spaced addresses in the
 * RX72N peripheral address space (0x00088300, 0x00088320, 0x00088340). Each
 * block is 32 bytes in size and contains all control, status, bit-rate, and
 * data registers for one channel.
 *
 * ## Memory Map
 *
 * | Channel | Accessor | Base Address | Register Block Size |
 * |---------|----------|--------------|---------------------|
 * | 0       | riic0()  | 0x00088300   | 32 bytes            |
 * | 1       | riic1()  | 0x00088320   | 32 bytes            |
 * | 2       | riic2()  | 0x00088340   | 32 bytes            |
 *
 * ## Why Return NULL for Invalid Channel
 *
 * Returning nullptr for an out-of-range channel allows every caller to perform
 * a single null-pointer check with RX_CHECK_NULL_PTR rather than duplicating
 * range validation logic. This pattern is consistent with rx_port_get_base()
 * in the GPIO driver.
 *
 * @param[in] channel RIIC channel number (valid range: 0 to k_riic_max_channels-1)
 *
 * @return Pointer to RIIC register structure
 * @retval Non-NULL Valid volatile register pointer aligned to the channel's
 *                  32-byte peripheral block for channels 0, 1, or 2
 * @retval NULL     Channel number is out of range (>= k_riic_max_channels)
 *
 * @pre channel must be less than k_riic_max_channels (3); values >= 3 yield nullptr
 * @pre caller must have verified that the corresponding RIIC module stop bit in
 *      MSTPCRB has been cleared (module enabled) before using the returned pointer
 * @post returned pointer is non-NULL if and only if channel is 0, 1, or 2
 * @post returned pointer, when non-NULL, is aligned to the RIIC peripheral register
 *       block boundary as required by the RX72N hardware specification
 *
 * @note This function does NOT validate the channel - the caller is responsible
 *       for ensuring the value is in range before calling
 * @note The return type is volatile to prevent the compiler from optimizing away
 *       hardware register reads or writes through the returned pointer
 *
 * @par Performance:
 * O(1) - simple switch statement with a direct return per case
 *
 * @par Example:
 * @code
 * // Look up the register base for RIIC channel 1 and send a START condition
 * volatile rx_riic_regs_t* riic = internal_get_riic_base(k_riic_channel_1);
 * if (riic == nullptr) {
 *     return k_rx_err_invalid_arg;
 * }
 * riic->iccr2 |= k_riic_iccr2_st;  // Issue START condition
 * @endcode
 *
 * @see riic0() Inline accessor for RIIC channel 0 base address
 * @see riic1() Inline accessor for RIIC channel 1 base address
 * @see riic2() Inline accessor for RIIC channel 2 base address
 * @see k_riic_max_channels Upper bound on valid channel numbers
 *
 * @since Version 1.0.0
 */
static volatile rx_riic_regs_t* internal_get_riic_base(const uint8_t channel)
{
  switch (channel) {
    case k_riic_channel_0: {
      return riic0();
    }
    case k_riic_channel_1: {
      return riic1();
    }
    case k_riic_channel_2: {
      return riic2();
    }
    default: {
      return nullptr;
    }
  }
}

/**
 * @brief Calculate RIIC bit rate register values for target frequency
 *
 * @details
 * Computes the ICBRL and ICBRH register values to achieve the desired I2C
 * bus frequency. Uses a simplified calculation assuming 50% duty cycle
 * (equal high and low periods).
 *
 * ## Calculation Algorithm
 *
 * The RX72N RIIC bit rate formula (from Chapter 42):
 * @f[
 *   f_{SCL} = \frac{f_{PCLKB}}{(ICBRL + 1) + (ICBRH + 1) + \text{sync}}
 * @f]
 *
 * Simplified for 50% duty cycle (ICBRL = ICBRH):
 * @f[
 *   \text{divisor} = \frac{f_{PCLKB}}{f_{target} \times 3}
 * @f]
 *
 * ## Example Calculations (PCLKB = 60 MHz)
 *
 * | Target    | Calculation         | Divisor | Actual Rate |
 * |-----------|---------------------|---------|-------------|
 * | 100 kHz   | 60M / (100k × 3)    | 200     | 100.0 kHz   |
 * | 400 kHz   | 60M / (400k × 3)    | 50      | 400.0 kHz   |
 * | 1 MHz     | 60M / (1M × 3)      | 20      | 1.00 MHz    |
 *
 * @param[in] frequency_hz Desired I2C clock frequency in Hz
 *                         (valid: 100000, 400000, or 1000000)
 * @param[out] icbrl Pointer to store ICBRL register value (SCL low period)
 * @param[out] icbrh Pointer to store ICBRH register value (SCL high period)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Success - icbrl and icbrh contain valid values
 * @retval k_rx_err_null_ptr Either icbrl or icbrh is nullptr
 * @retval k_rx_err_invalid_arg Calculated divisor out of range [1, 255]
 *
 * @pre icbrl != nullptr
 * @pre icbrh != nullptr
 * @pre frequency_hz is a supported I2C frequency
 * @post *icbrl contains the low-period divisor (1-255)
 * @post *icbrh contains the high-period divisor (1-255)
 * @post *icbrl == *icbrh (50% duty cycle)
 *
 * @note Uses PCLKB (60 MHz) as the source clock per RX72N specification.
 * @note For asymmetric duty cycle, manually set ICBRL != ICBRH after init.
 *
 * @warning Frequencies outside 100 kHz - 1 MHz may produce out-of-range divisors.
 *
 * @see riic_init() Uses this function during channel initialization
 * @see k_pclkb_hz PCLKB frequency constant from hardware.h
 */
static rx_err_t
internal_calculate_bit_rate(const uint32_t frequency_hz, uint8_t* icbrl, uint8_t* icbrh)
{
  /* PCLKB is used for RIIC (60 MHz on RX72N) */
  const uint32_t pclk = k_pclkb_hz;

  if (icbrl == nullptr || icbrh == nullptr) {
    return k_rx_err_null_ptr;
  }

  /* Calculate bit rate for standard formula:
   * I2C_CLK = PCLK / (2 * (ICBRL + 1) + (ICBRH + 1))
   * Simplified: ICBRL = ICBRH for 50% duty cycle
   */
  const uint32_t divisor = (pclk / frequency_hz) / k_riic_brr_divisor;

