Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
  if (divisor < k_riic_brr_min || divisor > k_riic_brr_max) {
    rx_log_error(s_tag, "Invalid frequency for PCLKB");
    return k_rx_err_invalid_arg;
  }

  *icbrl = (uint8_t)divisor;
  *icbrh = (uint8_t)divisor;

  return k_rx_ok;
}

/**
 * @brief Wait for I2C bus to become idle (not busy)
 *
 * @details
 * Polls the BBSY (Bus Busy) bit in ICCR2 until the bus is free or timeout
 * occurs. This function must be called before starting a new I2C transaction
 * to ensure no other controller is using the bus (multi-controller arbitration).
 *
 * ## Bus Busy Detection
 *
 * The BBSY bit is set when:
 * - A START condition is detected on the bus
 * - The controller has issued a START condition
 *
 * The BBSY bit is cleared when:
 * - A STOP condition is detected on the bus
 * - Bus arbitration is lost
 *
 * ## Timeout Calculation
 *
 * At 100 kHz (slowest mode), maximum byte transfer time:
 * - 9 bits per byte (8 data + 1 ACK) × 10 µs = 90 µs
 * - For 256 bytes (max transfer): 256 × 90 µs = 23 ms
 *
 * The 10 ms timeout (k_riic_timeout_us) provides margin for typical
 * operations while catching true bus-stuck conditions.
 *
 * @param[in] riic Pointer to RIIC register structure (must not be NULL)
 *
 * @return rx_err_t Error code indicating success or timeout
 * @retval k_rx_ok Bus is ready (BBSY = 0), safe to start transaction
 * @retval k_rx_err_null_ptr riic pointer is nullptr
 * @retval k_rx_err_timeout Bus remained busy for entire timeout period
 *
 * @pre riic != nullptr
 * @pre RIIC channel must be initialized and enabled
 * @post Bus is idle if k_rx_ok returned
 *
 * @note This is a blocking function - polls in tight loop.
 * @note Timeout is ~10ms at k_riic_timeout_us iterations.
 *
 * @warning In multi-controller systems, bus may become busy again immediately
 *          after this function returns - caller should proceed quickly.
 *
 * @par NASA Power of 10 Compliance
 * - Rule 2: [OK] Bounded loop with k_riic_timeout_us maximum iterations
 * - Rule 5: [OK] nullptr check via RX_CHECK_NULL_PTR
 */
static rx_err_t internal_wait_bus_ready(const volatile rx_riic_regs_t* riic)
{
  uint32_t timeout = k_riic_timeout_us;

  RX_CHECK_NULL_PTR(riic, s_tag, "RIIC peripheral base is nullptr");

  while ((riic->iccr2 & k_riic_iccr2_bbsy) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

  if (timeout == k_riic_timeout_zero) {
    rx_log_error(s_tag, "I2C bus busy timeout");
    return k_rx_err_timeout;
  }

  return k_rx_ok;
}

/**
 * @brief Generate I2C START condition on the bus
 *
 * @details
 * Issues a START condition by setting the ST bit in ICCR2, then waits for
 * hardware confirmation via the START flag in ICSR2. The START condition
 * signals all peripherals that a transaction is beginning.
 *
 * ## START Condition Timing
 *
 * ```
 *     SDA  ─────┐
 *               └──────────
 *     SCL  ───────────┐
 *                     └────
 *              │      │
 *              │      └─ SCL goes low (start of first bit)
 *              └─ SDA goes low while SCL high (START)
 * ```
 *
 * ## Hardware Sequence
 *
 * 1. Set ST bit in ICCR2 (request START)
 * 2. Hardware pulls SDA low while SCL is high
 * 3. Hardware sets START flag in ICSR2
 * 4. Software clears START flag to acknowledge
 *
 * @param[in,out] riic Pointer to RIIC register structure (must not be NULL)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok START condition successfully issued
 * @retval k_rx_err_null_ptr riic pointer is nullptr
 * @retval k_rx_err_timeout Hardware did not confirm START within timeout
 *
 * @pre riic != nullptr
 * @pre Bus must be idle (BBSY = 0) - use internal_wait_bus_ready() first
 * @pre RIIC channel must be enabled (ICE = 1)
 * @post START flag is cleared in ICSR2
 * @post Bus is now busy (BBSY = 1)
 *
 * @note Clears the START detection flag after successful START.
 * @note After START, caller must send address byte within timeout.
 *
 * @warning If START fails, caller must issue STOP to release bus.
 *
 * @see internal_send_stop() Companion function for ending transactions
 * @see internal_wait_bus_ready() Should be called before START
 */
static rx_err_t internal_send_start(volatile rx_riic_regs_t* riic)
{
  RX_CHECK_NULL_PTR(riic, s_tag, "RIIC peripheral base is nullptr");

  /* Issue start condition */
  riic->iccr2 |= k_riic_iccr2_st;

  /* Wait for start condition to be issued */
  uint32_t timeout = k_riic_timeout_us;
  while (!(riic->icsr2 & k_riic_icsr2_start) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

  if (timeout == k_riic_timeout_zero) {
    rx_log_error(s_tag, "Start condition timeout");
    return k_rx_err_timeout;
  }

  /* Clear start flag */
  riic->icsr2 &= (uint8_t) ~(uint8_t)k_riic_icsr2_start;

  return k_rx_ok;
}

/**
 * @brief Generate I2C STOP condition on the bus
 *
 * @details
 * Issues a STOP condition by setting the SP bit in ICCR2, then waits for
 * hardware confirmation via the STOP flag in ICSR2. The STOP condition
 * releases the bus for other controllers.
 *
 * ## STOP Condition Timing
 *
 * ```
 *     SDA  ──────────┌─────
 *                    │
 *     SCL  ────┌─────┴─────
 *              │     │
 *              │     └─ SDA goes high while SCL high (STOP)
 *              └─ SCL goes high (end of last bit/ACK)
 * ```
 *
 * ## Hardware Sequence
 *
 * 1. Set SP bit in ICCR2 (request STOP)
 * 2. Hardware drives SCL high
 * 3. Hardware drives SDA high while SCL is high
 * 4. Hardware sets STOP flag in ICSR2
 * 5. Software clears STOP flag to acknowledge
 *
 * ## Error Recovery
 *
 * STOP is also used for error recovery - if a transaction fails at any
 * point, issuing STOP releases the bus and resets the peripheral state
 * machine.
 *
 * @param[in,out] riic Pointer to RIIC register structure (must not be NULL)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok STOP condition successfully issued, bus is now idle
 * @retval k_rx_err_null_ptr riic pointer is nullptr
 * @retval k_rx_err_timeout Hardware did not confirm STOP within timeout
 *
 * @pre riic != nullptr
 * @pre A transaction is in progress (bus is busy)
 * @post STOP flag is cleared in ICSR2
 * @post Bus is idle (BBSY = 0)
 * @post Peripheral state machine returns to idle
 *
 * @note Always call STOP at the end of a transaction or to recover from errors.
 * @note STOP after NACK in read transactions signals end of transfer to peripheral.
 *
 * @par Best-Effort Cleanup
 * In error paths, STOP is called to release the bus even if the original
 * error should be preserved. The calling function should:
 * @code
 * if (err != k_rx_ok) {
 *     rx_err_t stop_err = internal_send_stop(riic);
 *     (void)stop_err;  // Preserve original error
 *     return err;
 * }
 * @endcode
 *
 * @see internal_send_start() Companion function for starting transactions
 */
static rx_err_t internal_send_stop(volatile rx_riic_regs_t* riic)
{
  RX_CHECK_NULL_PTR(riic, s_tag, "RIIC peripheral base is nullptr");

