Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
  /* Issue stop condition */
  riic->iccr2 |= k_riic_iccr2_sp;

  /* Wait for stop condition to be issued */
  uint32_t timeout = k_riic_timeout_us;
  while (!(riic->icsr2 & k_riic_icsr2_stop) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

  if (timeout == k_riic_timeout_zero) {
    rx_log_error(s_tag, "Stop condition timeout");
    return k_rx_err_timeout;
  }

  /* Clear stop flag */
  riic->icsr2 &= (uint8_t) ~(uint8_t)k_riic_icsr2_stop;

  return k_rx_ok;
}

/**
 * @brief Transmit single byte over I2C bus
 *
 * @details
 * Writes one byte to the I2C bus and waits for acknowledgment from the
 * peripheral. This function handles both address bytes and data bytes.
 *
 * ## Transmission Sequence
 *
 * 1. Wait for TDRE (Transmit Data Register Empty) flag
 * 2. Write byte to ICDRT (Transmit Data Register)
 * 3. Hardware shifts out 8 bits MSB-first
 * 4. Hardware generates 9th clock for ACK
 * 5. Peripheral drives SDA low (ACK) or leaves high (NACK)
 * 6. Check NACKF flag to determine response
 *
 * ## I2C Byte Timing
 *
 * ```
 *     SCL  ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐
 *          ││ ││ ││ ││ ││ ││ ││ ││ ││
 *          └┘ └┘ └┘ └┘ └┘ └┘ └┘ └┘ └┘
 *          D7 D6 D5 D4 D3 D2 D1 D0 ACK
 *     SDA  ───────────────────────┐
 *          Data bits (8)         └─ ACK (low)
 * ```
 *
 * ## NACK Handling
 *
 * NACK is received when:
 * - Address byte: No peripheral at that address
 * - Data byte: Peripheral buffer full or error condition
 * - Last byte: Normal end-of-read signaling (expected)
 *
 * @param[in,out] riic Pointer to RIIC register structure
 * @param[in] data Byte to transmit (address or data)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Byte transmitted and ACK received
 * @retval k_rx_err_timeout TDRE flag not set within timeout
 * @retval k_rx_err_nack Peripheral sent NACK (not acknowledge)
 *
 * @pre riic != nullptr (not checked - caller must ensure)
 * @pre START condition has been issued
 * @pre Previous byte (if any) has been acknowledged
 * @post On success, byte has been transmitted and ACK received
 * @post On NACK, NACKF flag is cleared for next operation
 *
 * @note Does NOT send START or STOP - caller manages transaction framing.
 * @note First byte after START should be address with R/W bit.
 *
 * @warning On NACK, caller should issue STOP to release bus.
 *
 * @par Address Byte Format
 * For address bytes, caller must format as: (addr << 1) | direction
 * - Write: (0x50 << 1) | 0 = 0xA0
 * - Read: (0x50 << 1) | 1 = 0xA1
 *
 * @see internal_read_byte() Companion function for receiving bytes
 */
static rx_err_t internal_write_byte(volatile rx_riic_regs_t* riic, const uint8_t data)
{
  /* Wait for transmit data empty */
  uint32_t timeout = k_riic_timeout_us;
  while (!(riic->icsr2 & k_riic_icsr2_tdre) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

  if (timeout == k_riic_timeout_zero) {
    rx_log_error(s_tag, "Write timeout");
    return k_rx_err_timeout;
  }

  /* Write data */
  riic->icdrt = data;

  /* Wait for ACK/NACK */
  timeout = k_riic_timeout_us;
  while ((riic->icsr2 & k_riic_icsr2_tdre) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

  if (timeout == k_riic_timeout_zero) {
    rx_log_error(s_tag, "ACK/NACK timeout");
    return k_rx_err_timeout;
  }

  /* Check for NACK */
  if (riic->icsr2 & k_riic_icsr2_nackf) {
    riic->icsr2 &= (uint8_t) ~(uint8_t)k_riic_icsr2_nackf;
    rx_log_error(s_tag, "NACK received");
    return k_rx_err_nack;
  }

  return k_rx_ok;
}

/**
 * @brief Receive single byte from I2C bus
 *
 * @details
 * Reads one byte from the I2C bus and sends ACK or NACK as specified.
 * The ACK/NACK response is configured before reading the byte from the
 * receive register.
 *
 * ## Reception Sequence
 *
 * 1. Wait for RDRF (Receive Data Register Full) flag
 * 2. Configure ACK/NACK response in ICMR3.ACKBT
 * 3. Read byte from ICDRR (Receive Data Register)
 * 4. Hardware generates ACK/NACK on 9th clock
 * 5. RDRF flag is cleared by read
 *
 * ## ACK vs NACK Decision
 *
 * | Situation         | Response | ACKBT | Purpose |
 * |-------------------|----------|-------|---------|
 * | More bytes to read | ACK      | 0     | Continue transfer |
 * | Last byte         | NACK     | 1     | Signal end of read |
 *
 * ## I2C Read Byte Timing
 *
 * ```
 *     SCL  ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐ ┌┐
 *          ││ ││ ││ ││ ││ ││ ││ ││ ││
 *          └┘ └┘ └┘ └┘ └┘ └┘ └┘ └┘ └┘
 *          D7 D6 D5 D4 D3 D2 D1 D0 ACK/NACK
 *     SDA  ───────────────────────┐
 *          Peripheral drives      └─ Controller drives ACK/NACK
 * ```
 *
 * @param[in,out] riic Pointer to RIIC register structure (must not be NULL)
 * @param[out] data Pointer to store received byte (must not be NULL)
 * @param[in] send_ack true = send ACK (more bytes expected),
 *                     false = send NACK (last byte)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Byte received successfully, stored in *data
 * @retval k_rx_err_null_ptr riic or data pointer is nullptr
 * @retval k_rx_err_timeout RDRF flag not set within timeout
 *
 * @pre riic != nullptr
 * @pre data != nullptr
 * @pre Controller is in receive mode (address + read bit sent)
 * @post *data contains the received byte
 * @post ACK or NACK has been sent to peripheral
 * @post RDRF flag is cleared
 *
 * @note ACK/NACK is configured BEFORE reading ICDRR.
 * @note NACK on last byte is REQUIRED per I2C specification.
 *
 * @warning Failure to send NACK on last byte may cause peripheral
 *          to continue driving data, corrupting next transaction.
 *
 * @par Example: Reading Multiple Bytes
 * @code
 * for (uint16_t i = 0; i < length; i++) {
 *     bool send_ack = (i < length - 1);  // ACK all except last
 *     err = internal_read_byte(riic, &buffer[i], send_ack);
 *     if (err != k_rx_ok) break;
 * }
 * @endcode
 *
 * @see internal_write_byte() Companion function for transmitting bytes
 */
static rx_err_t
internal_read_byte(volatile rx_riic_regs_t* riic, uint8_t* data, const bool send_ack)
{
  /* Wait for receive data full */
  uint32_t timeout = k_riic_timeout_us;

  RX_CHECK_NULL_PTR(riic, s_tag, "RIIC peripheral base is nullptr");
  RX_CHECK_NULL_PTR(data, s_tag, "data pointer is nullptr");

  while (!(riic->icsr2 & k_riic_icsr2_rdrf) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

