Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
  if (timeout == k_riic_timeout_zero) {
    rx_log_error(s_tag, "Read timeout");
    return k_rx_err_timeout;
  }

  /* Configure ACK/NACK for next byte */
  if (!send_ack) {
    riic->icmr3 |= k_riic_icmr3_ackbt_mask; /* ACKBT = 1 (NACK) */
  } else {
    riic->icmr3 &= (uint8_t) ~(uint8_t)k_riic_icmr3_ackbt_mask; /* ACKBT = 0 (ACK) */
  }

  /* Read data */
  *data = riic->icdrr;

  return k_rx_ok;
}

/**
 * @brief Execute I2C write phase for combined write-read transfer
 *
 * @details
 * Performs the write portion of a write-read (register read) transaction.
 * This typically writes a register address to the peripheral, which sets
 * an internal pointer for the subsequent read phase.
 *
 * ## Transaction Sequence
 *
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + W (0) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── Register Address ────────────────────▶│  ← write_data[0]
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── [Additional bytes...] ───────────────▶│  ← write_data[1..N]
 *     │                                            │
 *     │    (No STOP - read phase follows)          │
 * ```
 *
 * ## Error Handling
 *
 * On any error (timeout or NACK), this function issues a STOP condition
 * to release the bus before returning the error code.
 *
 * @param[in,out] riic Pointer to RIIC register structure
 * @param[in] device_addr I2C peripheral address (7-bit, 0x00-0x7F)
 * @param[in] write_data Buffer containing data to write (e.g., register address)
 * @param[in] write_length Number of bytes to write (typically 1-2)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Write phase completed, ready for read phase
 * @retval k_rx_err_timeout START, address, or data byte timeout
 * @retval k_rx_err_nack Peripheral did not acknowledge
 *
 * @pre riic points to valid, initialized RIIC channel
 * @pre device_addr.value <= 127
 * @pre write_data != nullptr
 * @pre write_length > 0
 * @pre Bus is idle (not busy)
 * @post On success: Bus is active, internal address pointer set
 * @post On failure: STOP issued, bus released
 *
 * @note Does NOT issue STOP on success - caller must continue with read
 *       phase or issue STOP.
 * @note On error, STOP is always issued for bus cleanup.
 *
 * @see internal_riic_read_phase() Continues the transaction with read
 * @see riic_write_read() Public API that combines both phases
 */
static rx_err_t internal_riic_write_phase(volatile rx_riic_regs_t* riic,
                                          const i2c_device_addr_t  device_addr,
                                          const uint8_t*           write_data,
                                          const uint16_t           write_length)
{
  /* Set controller transmit mode */
  riic->iccr2 = k_riic_iccr2_mst | k_riic_iccr2_trx;

  /* Send start condition */
  rx_err_t err = internal_send_start(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Start condition failed");

  /* Send device address (write) */
  err = internal_write_byte(riic, (device_addr.value << k_riic_addr_shift) | k_riic_addr_write_bit);
  if (err != k_rx_ok) {
    rx_err_t stop_err = internal_send_stop(riic);
    (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
    return err;
  }

  /* Send write data */
  for (uint16_t i = 0; i < write_length; i++) {
    err = internal_write_byte(riic, write_data[i]);
    if (err != k_rx_ok) {
      rx_err_t stop_err = internal_send_stop(riic);
      (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
      return err;
    }
  }

  return k_rx_ok;
}

/**
 * @brief Execute I2C read phase for combined write-read transfer
 *
 * @details
 * Performs the read portion of a write-read (register read) transaction.
 * Issues a repeated START condition (without releasing the bus), then
 * reads data bytes from the peripheral.
 *
 * ## Transaction Sequence
 *
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │    (Write phase completed, no STOP)        │
 *     │                                            │
 *     │──── REPEATED START ──────────────────────▶│
 *     │──── Address + R (1) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │◀─── Data Byte 0 ─────────────────────────◀─│
 *     │──── ACK ─────────────────────────────────▶│
 *     │◀─── Data Byte N-1 ───────────────────────◀─│
 *     │──── NACK ────────────────────────────────▶│  ← Signals end
 *     │                                            │
 *     │    (Caller issues STOP)                    │
 * ```
 *
 * ## Repeated START vs STOP+START
 *
 * The repeated START (Sr) is critical for atomic register reads:
 * - Prevents other controllers from arbitrating between address write and data read
 * - Ensures peripheral's internal address pointer is still valid
 * - Required by many I2C peripherals (EEPROMs, sensors, etc.)
 *
 * ## ACK/NACK Protocol
 *
 * Per I2C specification, the controller must NACK the last byte to signal
 * end of read. This allows the peripheral to release SDA for the STOP
 * condition.
 *
 * @param[in,out] riic Pointer to RIIC register structure
 * @param[in] device_addr I2C peripheral address (7-bit, 0x00-0x7F)
 * @param[out] read_data Buffer to store received data
 * @param[in] read_length Number of bytes to read (1-256)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Read phase completed successfully
 * @retval k_rx_err_timeout Repeated START, address, or data byte timeout
 * @retval k_rx_err_nack Peripheral did not acknowledge address
 *
 * @pre riic points to valid, initialized RIIC channel
 * @pre Write phase has been completed (bus is active)
 * @pre device_addr.value <= 127
 * @pre read_data != nullptr
 * @pre read_length > 0
 * @post On success: read_data contains received bytes
 * @post On failure: STOP issued, bus released
 *
 * @note Does NOT issue STOP on success - caller must issue STOP.
 * @note On error, STOP is always issued for bus cleanup.
 * @note NACK is automatically sent on last byte.
 *
 * @see internal_riic_write_phase() Precedes this function in write-read
 * @see riic_write_read() Public API that combines both phases
 */
static rx_err_t internal_riic_read_phase(volatile rx_riic_regs_t* riic,
                                         const i2c_device_addr_t  device_addr,
                                         uint8_t*                 read_data,
                                         const uint16_t           read_length)
{
  /* Send repeated start condition */
  riic->iccr2 |= k_riic_iccr2_rs;

  uint32_t timeout = k_riic_timeout_us;
  while (!(riic->icsr2 & k_riic_icsr2_start) && timeout > k_riic_timeout_zero) {
    timeout--;
  }

