Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
  if (timeout == k_riic_timeout_zero) {
    rx_err_t stop_err = internal_send_stop(riic);
    (void)stop_err; /* Best-effort cleanup on timeout */
    rx_log_error(s_tag, "Repeated start timeout");
    return k_rx_err_timeout;
  }

  riic->icsr2 &= (uint8_t) ~(uint8_t)k_riic_icsr2_start;

  /* Set controller receive mode */
  riic->iccr2 = k_riic_iccr2_mst;

  /* Send device address (read) */
  rx_err_t err =
    internal_write_byte(riic, (device_addr.value << k_riic_addr_shift) | k_riic_addr_read_bit);
  if (err != k_rx_ok) {
    rx_err_t stop_err = internal_send_stop(riic);
    (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
    return err;
  }

  /* Receive data bytes */
  for (uint16_t i = 0; i < read_length; i++) {
    const bool send_ack = (i < read_length - k_riic_last_index_offset); /* NACK on last byte */
    err                 = internal_read_byte(riic, &read_data[i], send_ack);
    if (err != k_rx_ok) {
      rx_err_t stop_err = internal_send_stop(riic);
      (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
      return err;
    }
  }

  return k_rx_ok;
}

/* =============================================================================
 * Public API Implementation
 * =============================================================================
 * These functions provide the user-facing I2C interface. All functions
 * validate inputs, check initialization state, and provide comprehensive
 * error reporting.
 * =============================================================================
 */

/**
 * @brief Initialize RIIC (I2C) channel for controller mode operation
 *
 * @details
 * Configures an RIIC channel for I2C controller mode communication at the
 * specified bus frequency. This function must be called before any I2C
 * transfers on the channel.
 *
 * ## Initialization Sequence
 *
 * 1. Validate channel number and frequency
 * 2. Enable RIIC module clock (clear MSTPCRB bit)
 * 3. Reset RIIC internal state (IICRST)
 * 4. Calculate and configure bit rate registers
 * 5. Configure controller mode, 7-bit addressing
 * 6. Enable I2C bus interface (ICE)
 * 7. Mark channel as initialized
 *
 * ## Module Stop Control
 *
 * The RIIC peripheral is disabled by default to save power. This function
 * enables the module clock by clearing the appropriate MSTPCRB bit:
 *
 * | Channel | MSTPCRB Bit | Default State |
 * |---------|-------------|---------------|
 * | RIIC0   | Bit 21      | Stopped       |
 * | RIIC1   | Bit 20      | Stopped       |
 * | RIIC2   | Bit 19      | Stopped       |
 *
 * ## Supported Frequencies
 *
 * | Frequency | Mode         | Use Case                |
 * |-----------|--------------|-------------------------|
 * | 100 kHz   | Standard     | Legacy devices          |
 * | 400 kHz   | Fast         | Most I2C peripherals    |
 * | 1 MHz     | Fast Plus    | High-speed sensors      |
 *
 * @param[in] channel RIIC channel to initialize (0, 1, or 2)
 * @param[in] frequency_hz I2C bus clock frequency (100000, 400000, or 1000000)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Channel initialized successfully
 * @retval k_rx_err_invalid_arg Invalid channel (>= 3) or unsupported frequency
 *
 * @pre channel.value < 3
 * @pre frequency_hz is one of: 100000, 400000, 1000000
 * @post Channel is enabled and ready for I2C transfers
 * @post s_riic_channel_initialized[channel.value] == true
 *
 * @note This function modifies protected registers (MSTPCRB) using PRCR unlock.
 * @note Re-initializing an already initialized channel is allowed.
 * @note Pin configuration (MPC) must be done separately if needed.
 *
 * @warning Using unsupported frequencies may cause communication failures.
 *
 * @par Example
 * @code
 * // Initialize RIIC0 for Fast mode (400 kHz)
 * riic_channel_t channel = {.value = 0};
 * rx_err_t err = riic_init(channel, 400000);
 * if (err != k_rx_ok) {
 *     rx_log_error("I2C", "Failed to initialize RIIC0");
 * }
 * @endcode
 *
 * @see riic_write() Write data after initialization
 * @see riic_read() Read data after initialization
 * @see riic_write_read() Combined write-read after initialization
 *
 * @since Version 1.0.0
 *
 * @callgraph
 */
rx_err_t riic_init(const riic_channel_t channel, const uint32_t frequency_hz)
{
  /* Validate channel */
  if (channel.value >= k_riic_max_channels) {
    rx_log_error(s_tag, "Invalid RIIC channel");
    return k_rx_err_invalid_arg;
  }

  /* Validate frequency (100kHz, 400kHz, or 1MHz) */
  if (frequency_hz != k_riic_freq_100khz && frequency_hz != k_riic_freq_400khz &&
      frequency_hz != k_riic_freq_1mhz) {
    rx_log_error(s_tag, "Invalid I2C frequency (use 100000, 400000, or 1000000)");
    return k_rx_err_invalid_arg;
  }

  /* Get RIIC base */
  volatile rx_riic_regs_t* const riic = internal_get_riic_base(channel.value);
  if (riic == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Enable RIIC module (clear module stop bit) */
  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;

  if (channel.value == k_riic_channel_0) {
    system_regs()->mstpcrb &= ~((uint32_t)k_riic_mstpb_bit_value << k_riic_mstpb_riic0);
  } else if (channel.value == k_riic_channel_1) {
    system_regs()->mstpcrb &= ~((uint32_t)k_riic_mstpb_bit_value << k_riic_mstpb_riic1);
  } else {
    system_regs()->mstpcrb &= ~((uint32_t)k_riic_mstpb_bit_value << k_riic_mstpb_riic2);
  }

  *prcr_reg() = k_rx_prcr_lock;

  /* Reset RIIC */
  riic->iccr1 = k_riic_iccr1_iicrst;
  riic->iccr1 = k_riic_timeout_zero;

  /* Calculate bit rate */
  uint8_t  icbrl = 0;
  uint8_t  icbrh = 0;
  const rx_err_t err = internal_calculate_bit_rate(frequency_hz, &icbrl, &icbrh);
  RX_RETURN_ON_ERROR(err, s_tag, "Bit rate calculation failed");

  /* Configure bit rate */
  riic->icbrl = icbrl;
  riic->icbrh = icbrh;

  /* Configure RIIC for controller mode */
  riic->icmr1 = k_riic_icmr1_controller_7bit; /* Controller mode, 7-bit addressing */
  riic->icmr2 = k_riic_icmr2_default;         /* No timeout, no clock sync */
  riic->icmr3 = k_riic_icmr2_default;         /* ACKBT = 0 (ACK) */

  /* Enable I2C bus interface */
  riic->iccr1 = k_riic_iccr1_ice;

  /* Mark channel as initialized */
  s_riic_channel_initialized[channel.value] = true;

  rx_log_debug(s_tag, "RIIC channel initialized");

