Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
  return k_rx_ok;
}

/**
 * @brief Write data to an I2C peripheral device
 *
 * @details
 * Performs a complete I2C write transaction: START, address+W, data bytes,
 * STOP. This function is suitable for writing configuration registers,
 * sending commands, or storing data in EEPROM.
 *
 * ## Transaction Sequence
 *
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + W (0) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── data[0] ─────────────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── data[N-1] ───────────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── STOP ────────────────────────────────▶│
 * ```
 *
 * ## Common Use Cases
 *
 * | Use Case               | Data Format                    |
 * |------------------------|--------------------------------|
 * | Config register write  | [reg_addr, value]              |
 * | Multi-byte register    | [reg_addr, val0, val1, ...]    |
 * | EEPROM page write      | [addr_hi, addr_lo, data...]    |
 * | Sensor command         | [command_byte]                 |
 *
 * ## Error Handling
 *
 * On any error (timeout or NACK), the function issues a STOP condition
 * to release the bus before returning. The original error code is preserved.
 *
 * @param[in] channel RIIC channel (must be initialized via riic_init())
 * @param[in] device_addr I2C peripheral address (7-bit, 0x00-0x7F)
 * @param[in] data Buffer containing data to write
 * @param[in] length Number of bytes to write (1-256)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok All bytes written successfully
 * @retval k_rx_err_null_ptr data pointer is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel, address, or length
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_timeout Bus busy, START, or byte transfer timeout
 * @retval k_rx_err_nack Peripheral did not acknowledge address or data
 *
 * @pre riic_init() called for this channel
 * @pre data != nullptr
 * @pre length >= 1 && length <= 256
 * @pre device_addr.value <= 127
 * @post On success: All bytes transferred, bus released
 * @post On failure: Bus released via STOP
 *
 * @note This is a blocking function - returns only after transfer complete.
 * @note STOP is always issued (success or failure) to release the bus.
 *
 * @warning NACK on address usually means device not present or wrong address.
 * @warning NACK on data may indicate device buffer full or write-protected.
 *
 * @par Example: Write Configuration Register
 * @code
 * // Write value 0x42 to register 0x05 of device at address 0x48
 * uint8_t config_data[2] = {0x05, 0x42};  // [reg_addr, value]
 * riic_channel_t channel = {.value = 0};
 * i2c_device_addr_t addr = {.value = 0x48};
 *
 * rx_err_t err = riic_write(channel, addr, config_data, 2);
 * if (err != k_rx_ok) {
 *     handle_i2c_error(err);
 * }
 * @endcode
 *
 * @see riic_init() Initialize channel before use
 * @see riic_read() Read-only transaction
 * @see riic_write_read() Combined write-then-read transaction
 *
 * @callgraph
 */
rx_err_t riic_write(const riic_channel_t    channel,
                    const i2c_device_addr_t device_addr,
                    const uint8_t*          data,
                    const uint16_t          length)
{
  RX_CHECK_NULL_PTR(data, s_tag, "Data pointer is nullptr");
  RX_CHECK_RANGE_TAG(channel.value,
                     k_riic_channel_0,
                     (uint8_t)(k_riic_max_channels - k_riic_last_index_offset),
                     k_rx_err_invalid_arg,
                     s_tag);

  if (device_addr.value > k_riic_addr_max_7bit) {
    rx_log_error(s_tag, "Invalid device address");
    return k_rx_err_invalid_arg;
  }

  if (length == k_riic_length_zero) {
    rx_log_error(s_tag, "Write length cannot be zero");
    return k_rx_err_invalid_arg;
  }

  if (length > k_riic_max_transfer_length) {
    rx_log_error(s_tag, "Write length exceeds maximum");
    return k_rx_err_invalid_arg;
  }

  /* Validate channel */
  if (channel.value >= k_riic_max_channels || !s_riic_channel_initialized[channel.value]) {
    rx_log_error(s_tag, "RIIC channel not initialized");
    return k_rx_err_invalid_state;
  }

  /* Get RIIC base */
  volatile rx_riic_regs_t* riic = internal_get_riic_base(channel.value);

  /* Wait for bus ready */
  rx_err_t err = internal_wait_bus_ready(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Bus not ready");

  /* Set controller transmit mode */
  riic->iccr2 = k_riic_iccr2_mst | k_riic_iccr2_trx;

  /* Send start condition */
  err = internal_send_start(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Start condition failed");

  /* Send device address (write) */
  err = internal_write_byte(riic, (device_addr.value << k_riic_addr_shift) | k_riic_addr_write_bit);
  if (err != k_rx_ok) {
    rx_err_t stop_err = internal_send_stop(riic);
    (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
    return err;
  }

  /* Send data bytes */
  for (uint16_t i = 0; i < length; i++) {
    err = internal_write_byte(riic, data[i]);
    if (err != k_rx_ok) {
      rx_err_t stop_err = internal_send_stop(riic);
      (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
      return err;
    }
  }

  /* Send stop condition */
  err = internal_send_stop(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Stop condition failed");

  return k_rx_ok;
}

/**
 * @brief Read data from an I2C peripheral device
 *
 * @details
 * Performs a complete I2C read transaction: START, address+R, receive data
 * bytes (ACK all except last), NACK last byte, STOP. This function is suitable
 * for reading device status, sensor data, or sequential memory reads where
 * the device auto-increments its internal pointer.
 *
 * ## Transaction Sequence
 *
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + R (1) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │◀─── data[0] ─────────────────────────────◀─│
 *     │──── ACK ─────────────────────────────────▶│
 *     │◀─── data[N-2] ───────────────────────────◀─│
 *     │──── ACK ─────────────────────────────────▶│
 *     │◀─── data[N-1] ───────────────────────────◀─│
 *     │──── NACK ────────────────────────────────▶│  ← Last byte
 *     │──── STOP ────────────────────────────────▶│
 * ```
 *
 * ## When to Use riic_read() vs riic_write_read()
 *
 * | Function | Use When |
 * |----------|----------|
 * | riic_read() | Device auto-increments address, or reading status |
 * | riic_write_read() | Need to specify register address first |
 *
 * ## Common Use Cases
 *
 * - Read device status register (if device supports direct read)
 * - Continue reading after previous write set address pointer
 * - Read from devices with auto-increment address mode
 *
 * @param[in] channel RIIC channel (must be initialized via riic_init())
 * @param[in] device_addr I2C peripheral address (7-bit, 0x00-0x7F)
 * @param[out] data Buffer to store received data
 * @param[in] length Number of bytes to read (1-256)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok All bytes read successfully
 * @retval k_rx_err_null_ptr data pointer is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel, address, or length
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_timeout Bus busy, START, or byte receive timeout
 * @retval k_rx_err_nack Peripheral did not acknowledge address
 *
 * @pre riic_init() called for this channel
 * @pre data != nullptr
 * @pre Buffer size >= length
 * @pre length >= 1 && length <= 256
 * @pre device_addr.value <= 127
 * @post On success: data contains received bytes, bus released
 * @post On failure: Bus released via STOP
 *
 * @note This is a blocking function - returns only after transfer complete.
 * @note NACK is automatically sent before reading last byte.
 *
 * @warning Most peripherals require riic_write_read() to specify which
 *          register to read from. Use this function only when the device
 *          supports direct reads or address auto-increment.
 *
 * @par Example: Read Temperature Sensor (Direct Read)
 * @code
 * // Read 2 bytes from temperature sensor at address 0x48
 * // (sensor auto-reports temperature on read)
 * uint8_t temp_data[2];
 * riic_channel_t channel = {.value = 0};
 * i2c_device_addr_t addr = {.value = 0x48};
 *
 * rx_err_t err = riic_read(channel, addr, temp_data, 2);
 * if (err == k_rx_ok) {
 *     int16_t raw = (temp_data[0] << 8) | temp_data[1];
 *     float celsius = raw * 0.0625f;
 * }
 * @endcode
 *
 * @see riic_init() Initialize channel before use
 * @see riic_write() Write-only transaction
 * @see riic_write_read() Combined write-then-read (register read)
 *
 * @callgraph
 */
rx_err_t riic_read(const riic_channel_t    channel,
                   const i2c_device_addr_t device_addr,
                   uint8_t*                data,
                   const uint16_t          length)
{
  RX_CHECK_NULL_PTR(data, s_tag, "Data pointer is nullptr");
  RX_CHECK_RANGE_TAG(channel.value,
                     k_riic_channel_0,
                     (uint8_t)(k_riic_max_channels - k_riic_last_index_offset),
                     k_rx_err_invalid_arg,
                     s_tag);

  if (device_addr.value > k_riic_addr_max_7bit) {
    rx_log_error(s_tag, "Invalid device address");
    return k_rx_err_invalid_arg;
  }

  if (length == k_riic_length_zero) {
    rx_log_error(s_tag, "Read length cannot be zero");
    return k_rx_err_invalid_arg;
  }

