Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/riic.c
  if (length > k_riic_max_transfer_length) {
    rx_log_error(s_tag, "Read length exceeds maximum");
    return k_rx_err_invalid_arg;
  }

  /* Validate channel */
  if (channel.value >= k_riic_max_channels || !s_riic_channel_initialized[channel.value]) {
    rx_log_error(s_tag, "RIIC channel not initialized");
    return k_rx_err_invalid_state;
  }

  /* Get RIIC base */
  volatile rx_riic_regs_t* riic = internal_get_riic_base(channel.value);

  /* Wait for bus ready */
  rx_err_t err = internal_wait_bus_ready(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Bus not ready");

  /* Set controller receive mode */
  riic->iccr2 = k_riic_iccr2_mst;

  /* Send start condition */
  err = internal_send_start(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Start condition failed");

  /* Send device address (read) */
  err = internal_write_byte(riic, (device_addr.value << k_riic_addr_shift) | k_riic_addr_read_bit);
  if (err != k_rx_ok) {
    rx_err_t stop_err = internal_send_stop(riic);
    (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
    return err;
  }

  /* Receive data bytes */
  for (uint16_t i = 0; i < length; i++) {
    const bool send_ack = (i < length - k_riic_last_index_offset); /* NACK on last byte */
    err                 = internal_read_byte(riic, &data[i], send_ack);
    if (err != k_rx_ok) {
      rx_err_t stop_err = internal_send_stop(riic);
      (void)stop_err; /* Preserve original error, stop is best-effort cleanup */
      return err;
    }
  }

  /* Send stop condition */
  err = internal_send_stop(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Stop condition failed");

  return k_rx_ok;
}

/**
 * @brief Combined write-then-read I2C transaction (register read)
 *
 * @details
 * Performs a complete I2C write-read transaction using a repeated START
 * condition. This is the most common pattern for reading registers from
 * I2C peripherals: write the register address, then read the data.
 *
 * ## Transaction Sequence (Register Read)
 *
 * ```
 * Controller                                   Peripheral
 *     │                                            │
 *     │──── START ────────────────────────────────▶│
 *     │──── Address + W (0) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │──── Register Address ────────────────────▶│  ← write_data
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │                                            │
 *     │──── REPEATED START ──────────────────────▶│  ← No STOP!
 *     │                                            │
 *     │──── Address + R (1) ──────────────────────▶│
 *     │◀─── ACK ─────────────────────────────────◀─│
 *     │◀─── Register Data ───────────────────────◀─│  ← read_data
 *     │──── ACK/NACK ────────────────────────────▶│
 *     │──── STOP ────────────────────────────────▶│
 * ```
 *
 * ## Why Repeated START?
 *
 * The repeated START (Sr) is critical for atomic register access:
 *
 * | Approach | Bus Release | Risk |
 * |----------|-------------|------|
 * | STOP + START | Yes | Another controller could interrupt |
 * | Repeated START | No | Transaction is atomic |
 *
 * Many I2C peripherals require repeated START and may not work correctly
 * with separate write-then-read transactions.
 *
 * ## Common Use Cases
 *
 * | Peripheral Type | write_data        | read_length | Purpose |
 * |-----------------|-------------------|-------------|---------|
 * | Temperature     | [reg_addr]        | 2           | Read temp register |
 * | EEPROM          | [addr_hi, addr_lo]| N           | Read N bytes |
 * | Accelerometer   | [reg_addr]        | 6           | Read XYZ axes |
 * | RTC             | [seconds_reg]     | 7           | Read time |
 *
 * @param[in] channel RIIC channel (must be initialized via riic_init())
 * @param[in] device_addr I2C peripheral address (7-bit, 0x00-0x7F)
 * @param[in] write_data Buffer containing data to write (typically register address)
 * @param[in] write_length Number of bytes to write (typically 1-2)
 * @param[out] read_data Buffer to store received data
 * @param[in] read_length Number of bytes to read (1-256)
 *
 * @return rx_err_t Error code indicating success or failure
 * @retval k_rx_ok Transaction completed successfully
 * @retval k_rx_err_null_ptr write_data or read_data is nullptr
 * @retval k_rx_err_invalid_arg Invalid channel, address, or length
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_timeout Bus busy or any phase timeout
 * @retval k_rx_err_nack Peripheral did not acknowledge address/data
 *
 * @pre riic_init() called for this channel
 * @pre write_data != nullptr
 * @pre read_data != nullptr
 * @pre write_length >= 1 && write_length <= 256
 * @pre read_length >= 1 && read_length <= 256
 * @pre device_addr.value <= 127
 * @post On success: read_data contains register contents, bus released
 * @post On failure: Bus released via STOP
 *
 * @note This is a blocking function - returns only after transfer complete.
 * @note Uses repeated START (no bus release between write and read phases).
 * @note NACK is automatically sent before reading last byte.
 *
 * @par Example: Read WHO_AM_I Register from IMU
 * @code
 * // Read WHO_AM_I register (0x0F) from MPU6050 at address 0x68
 * riic_channel_t channel = {.value = 0};
 * i2c_device_addr_t imu_addr = {.value = 0x68};
 *
 * uint8_t reg_addr = 0x0F;  // WHO_AM_I register
 * uint8_t who_am_i;
 *
 * rx_err_t err = riic_write_read(channel, imu_addr,
 *                                &reg_addr, 1,    // Write: register address
 *                                &who_am_i, 1);   // Read: 1 byte
 *
 * if (err == k_rx_ok && who_am_i == 0x68) {
 *     // IMU detected and responding correctly
 * }
 * @endcode
 *
 * @par Example: Read 6 Bytes of Accelerometer Data
 * @code
 * // Read ACCEL_XOUT_H through ACCEL_ZOUT_L (6 bytes starting at 0x3B)
 * uint8_t reg_addr = 0x3B;
 * uint8_t accel_data[6];
 *
 * rx_err_t err = riic_write_read(channel, imu_addr,
 *                                &reg_addr, 1,
 *                                accel_data, 6);
 *
 * if (err == k_rx_ok) {
 *     int16_t accel_x = (accel_data[0] << 8) | accel_data[1];
 *     int16_t accel_y = (accel_data[2] << 8) | accel_data[3];
 *     int16_t accel_z = (accel_data[4] << 8) | accel_data[5];
 * }
 * @endcode
 *
 * @see riic_init() Initialize channel before use
 * @see riic_write() Write-only transaction
 * @see riic_read() Read-only transaction (no address write)
 *
 * @callgraph
 */
rx_err_t riic_write_read(const riic_channel_t    channel,
                         const i2c_device_addr_t device_addr,
                         const uint8_t*          write_data,
                         const uint16_t          write_length,
                         uint8_t*                read_data,
                         const uint16_t          read_length)
{
  RX_CHECK_NULL_PTR(write_data, s_tag, "Write data pointer is nullptr");
  RX_CHECK_NULL_PTR(read_data, s_tag, "Read data pointer is nullptr");
  RX_CHECK_RANGE_TAG(channel.value,
                     k_riic_channel_0,
                     (uint8_t)(k_riic_max_channels - k_riic_last_index_offset),
                     k_rx_err_invalid_arg,
                     s_tag);

  if (device_addr.value > k_riic_addr_max_7bit) {
    rx_log_error(s_tag, "Invalid device address");
    return k_rx_err_invalid_arg;
  }

  if (write_length == k_riic_length_zero || read_length == k_riic_length_zero) {
    rx_log_error(s_tag, "Read/write length cannot be zero");
    return k_rx_err_invalid_arg;
  }

  if (write_length > k_riic_max_transfer_length || read_length > k_riic_max_transfer_length) {
    rx_log_error(s_tag, "Read/write length exceeds maximum");
    return k_rx_err_invalid_arg;
  }

  /* Validate channel */
  if (channel.value >= k_riic_max_channels || !s_riic_channel_initialized[channel.value]) {
    rx_log_error(s_tag, "RIIC channel not initialized");
    return k_rx_err_invalid_state;
  }

  /* Get RIIC base */
  volatile rx_riic_regs_t* riic = internal_get_riic_base(channel.value);

  /* Wait for bus ready */
  rx_err_t err = internal_wait_bus_ready(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Bus not ready");

  /* Perform write phase */
  err = internal_riic_write_phase(riic, device_addr, write_data, write_length);
  if (err != k_rx_ok) {
    return err;
  }

  /* Perform read phase */
  err = internal_riic_read_phase(riic, device_addr, read_data, read_length);
  if (err != k_rx_ok) {
    return err;
  }

  /* Send stop condition */
  err = internal_send_stop(riic);
  RX_RETURN_ON_ERROR(err, s_tag, "Stop condition failed");

  return k_rx_ok;
}
